app/views/subscriptions/_subscription.html.erb


  <% if subscription.user.present? %>
---
SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]