app/controllers/application_controller.rb

  def current_user_can_edit?(model)
    user_signed_in? &&
      (model.user == current_user || (model.try(:event).present? && model.event.user == current_user))
---
SELECT  "events".* FROM "events" WHERE "events"."id" = ? LIMIT ?  [["id", 3], ["LIMIT", 1]]
SELECT  "users".* FROM "users" WHERE "users"."id" = ? ORDER BY "users"."id" ASC LIMIT ?  [["id", 2], ["LIMIT", 1]]

  def current_user_can_subscribe?(model)
    !current_user_can_edit?(model) && @event.subscriptions.find_by(user: current_user).blank?
---
SELECT  "subscriptions".* FROM "subscriptions" WHERE "subscriptions"."event_id" = ? AND "subscriptions"."user_id" = ? LIMIT ?  [["event_id", 2], ["user_id", 2], ["LIMIT", 1]]