app/controllers/photos_controller.rb

INSERT INTO "photos" ("photo", "event_id", "user_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)
---
  def create
    @new_photo = @event.photos.build(photo_params)
    @new_photo.user = current_user

    if @new_photo.save

SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
SELECT "subscriptions".* FROM "subscriptions" WHERE "subscriptions"."event_id" = ?  [["event_id", 3]]
---
    def notify_subscribers_new_photo(event, photo)
      all_emails = (event.subscriptions.map(&:user_email) + [event.user.email]).uniq - [current_user.email]